exacttarget/exacttarget-connector/exacttarget-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/exacttarget/api_updateSubscriberAttributes_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <fueloauth xmlns="http://exacttarget.com">%s(accessToken)</fueloauth>
   </soapenv:Header>
   <soapenv:Body>
      <UpdateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
         <Options>
            <CallsInConversation>1</CallsInConversation>
            <ConversationID>%s(apiUpdateSubscriberAttributes)</ConversationID>
            <RequestType>Asynchronous</RequestType>
            <SequenceCode>1</SequenceCode>
         </Options>
         <Objects xsi:type="Subscriber">
            <Attributes>
               <Name>%s(subscriberAtr1)</Name>
               <Value>%s(apiUpdateSubscriberAttributes)</Value>
            </Attributes>
            <Attributes>
               <Name>%s(subscriberAtr2)</Name>
               <Value>%s(apiUpdateSubscriberAttributes)</Value>
            </Attributes>
            <SubscriberKey>%s(subscriberKey)</SubscriberKey>
         </Objects>
      </UpdateRequest>
   </soapenv:Body>
</soapenv:Envelope>